{"review":"Incredible. One of the best novels I have ever had the pleasure to read. McCarthy is a master story teller. I have never read a book by him I did not fall in love with. Bruce Dodso","domain":"books","label":"positive"}
{"review":"In recent years, a lot of people have noticed that book clubs demand a lot of books.  No surprise, but the next conclusion is that the taste of book club audiences influence what gets published.  I think this is why we have books like \"the Devil wore Prada\" that are soon followed by \"Prep.\"  This is why people who read \"Evensong\" soon pick up \"Brick Lane\" and \"The Liars Club.\"  My wife belongs to a book club.  They have read all of these books. If men participated in books clubs to the same extent that women do (and I wish that they did), then Cormac McCarthy novels would spawn their own genre. Cities of the Plain is not about balancing your career with your relationships. It is not about good shoes or good sex.  It is about important things like falling in love with the impossibly wrong girl.  It is about vast open spaces that leave room for men to make decisions.  (Maybe that is what it takes.) Also, it is about horses and guns and blood and honor. This is oversimplification.  There is a specific plot: John Grady Cole works with his friend Billy Parham on a ranch near the border with Mexico.  John Grady falls in love with a prostitute at a brothel on the other side.  He wants to marry her.  Their union is ill-fated. John Grady feels that he loves her.  To him, his love is worthless if it not worth dying for.  That is the question he faces. I encourage people to read this book.  It is the last in a trilogy.  It was my favorite of all three.","domain":"books","label":"positive"}
{"review":"I usually read every night to my wife.  We've gone through dozens of books together in our marriage, and several months ago, I read \"All the Pretty Horses\" to her.  She loved it, and would not let me read her anything else until we had read McCarthy's entire trilogy.  We just finished it. This book, the third in that trilogy, has its shortcomings, but it is still one amazing piece of work. In this book, John Grady Cole--the genius horsetrainer of \"All the Pretty Horses\"--and Billy Parham--the kindhearted nomad of \"The Crossing\"--come together as ranch hands on a New Mexico estancia.  Both are older than they were in the previous books--Billy much older--but both are kindred spirits whose stories connect with and affect each another. The book tends more heavily toward the lengthy philosophical monologues that appear only occasionally in the trilogy's earlier volumes, and the whole story at momemnts goes a little bit long if you've just read the two previous volumes right before. However, the writing is gorgeous, and haunting.  For example, in one passage, a dead calf's \"ribcage lay with curved tines upturned on the gravel plain like some carnivorous plant brooding in the barren dawn.\"  Yeah. And the ending--the ending is amazing.  It might not be quite what you expect or ask for, but it is thrilling in its perfectness, in its completess, in how true it feels. It left me holding the book like a priceless religious relic, re-reading its back cover, flipping back through it to parts I had marked, reluctant and unwilling to let go of these characters or their world. Cormac McCarthy is a literary genius.  He has made the West tangible, taken its most ineffable qualities and turned them into words.  He makes me homesick for the place I already live. Do not start with this book, if you've never read his other works, but do work up to it.  Do read it.","domain":"books","label":"positive"}
{"review":"Cities on the Plain is the final volume in Cormac McCarthy's Border Trilogy, a loosely tied together trio of novels that deal with life along the U.S.-Mexico border.  This novel focuses on the protagonists of each of the first two books - John Grady Cole from All the Pretty Horses and Billy Parham from the Crossing.  Now the two of them are working together on a ranch in New Mexico in the early 1950s. The rather sketchy plot involves Cole who has fallen hard for a Mexican prostitute.  His love for her has more than a little bit of obsession to it, and Cole is willing to risk all to be with her.  It is his eventual intent to bring her to the U.S. and marry her, although her pimp may have other ideas. At times, however, the story is secondary as we follow the other smaller adventures in these characters' lives.  McCarthy's great gifts are with his descriptive ability.  He is not always an easy read, however:  he never uses quotes to set off his dialogue and he uses a lot of Spanish, much of which is left untranslated and (for a non-Spanish speaker) can only be partially gleaned from context. Despite these difficulties, the book is somehow a pleasure to read (although it is probably the weakest in the trilogy).  In some ways it is reminiscent of the movie Brokeback Mountain, if only because it follows the rough life of modern cowboys.  Cole and Parham live tough lives with little hope of any permanence or prosperity, but they are also somewhat content with their choices. McCarthy is probably an overrated writer, with his distinct style providing an illusion of greater ability than he actually has.  But even if he is not great, he is still good and if you have the patience, you may find this an enjoyable book.","domain":"books","label":"positive"}
{"review":"This final installment to the Border Trilogy, like the preceding volumes, stands on it own, but stands on it's own less than either of the other two. This wouldn't be the book to read if you've never read Big Mac before. If you're a hardcore reader, go for Blood Meridian (his best). Or Suttree (his other best). If you're testing the water, and only used to reading pop crime novls or medical mysteries and want to delve a little deeper, start with All the Pretty Horses and work your way into the rest. What's it like? Think of Faulkner, then have him write a John Steinbeck story, with Hemmigway editing. Mac is better than Steinbeck, has more flower than Hemmingway, not as much as Faulkner. But make no mistake, he work is peer to the old masters. America's finest living author.","domain":"books","label":"positive"}
{"review":"Being a fan of such authors as J.R.R. Tolkien, H.G. Wells, and C.S. Lewis, I figured I'd try and broaden my horizons by reading a book about the American West, a sort of historical fiction that might be entertaining. I did some research and Cormac McCarthy seemed to be the author to start with.  He got very good reviews (from this site and professional critics).  I find it amazing that he received such great reviews... this book failed to impress me in the slightest bit.  The book seemed to fly away from the plot for a while and suddenly, unexpectedly return to it.  I have never read a book like that before.  After completing this book I had found out more about the life of a prostitute than I ever wanted to know and also I received a free lesson in swearing.  I understand that it was custom in the West to swear, and dealings with prostitutes was common, but I think McCarthy went over the top.  This made it uninteresting and redundant.  Then there was the fact that he rarely used punctuation other than periods, question marks, and exclamation marks.  I did not see a single quotation mark and the word \"and\" was excessevely overused due to the exclusion of commas.  Dialogue was at times hard to follow and seemingly run-on sentences were monotonous.  After reading this book I also felt ignorant being uneducated in the Spanish language.  Much of the dialogue I could not understand in the least bit.  There were entire conversations written exclusively in Spanish at times when it seemed relevant.  I felt like I missed a lot of important information in the story. I did find that at time McCarthy did use some beautifully crafted language but the formerly mentioned factors left a very bad impression on me.  I don't suppose I'll ever read a book by Cormac McCarthy again","domain":"books","label":"negative"}
{"review":"This final novel in Cormac McCarthy's Border Trilogy of the southwest brings together the themes McCarthy has developed throughout the trilogy.  In the first novel, All the Pretty Horses, McCarthy stresses the romanticism of John Grady Cole, who runs away to become a cowboy, suffers a heart-breaking loss at love, and returns, sadder and perhaps wiser, to find solace in the solitude of his work on the plains. Times are changing as the 20th century progresses, however, and the independent life of ranchers is threatened.  In The Crossing, a far darker novel which takes place a few years later, Billy Parham, another young man, takes off with his brother, crossing the border into Mexico, to explore its older traditions and ways of life.  Cities of the Plain, with Biblical suggestions in the title, brings young John Grady Cole and the older Billy Parham together, as they work on the McGovern ranch in Texas in the 1950s.  The wilderness is disappearing, cities are encroaching, and an army base may take their land. Focusing less on the harshness of ranch life than in past novels, McCarthy here concentrates more on character, in this case, that of John Grady Cole, who falls in love with a prostitute from Juarez and wants to bring her across the border to his way of life.  Billy Parham counsels him against marrying her, but John Grady is determined to wrest her away from Eduardo, her manager, and give her the peace that she has never known.  Life is harsh, however, and outcomes are bleak for dreamers and altruists.  John Grady soon finds himself engaged in a struggle with Eduardo which is vicious and unrelenting, a metaphorical struggle between honor and evil, and between civilized values and the \"justice\" of tooth and claw, hope and desperation, and acceptance of change and adherence to the past. McCarthy's gorgeous descriptions of this vanishing way of life on the ranch are as effective here as they are in the other novels in the trilogy, though they seem to be presented nostalgically.  Times are changing, and the \"old man,\" the ranch owner, is now becoming senile.  Civilization is drawing closer, and John Grady, the cowboy, uses taxis instead of horses when he is in a hurry to travel.  As McCarthy draws the reader into John Grady's story, the reader knows that the struggle between him and Eduardo is a mythic struggle, and s/he also knows what the likely outcome will be.  The elegance with which the ending is drawn, however, gives both potency and poignancy to McCarthy's message.  Mary Whipple","domain":"books","label":"positive"}
{"review":"Read this book at a light warehouse because you will NOT want to be anywhere near the dark!","domain":"books","label":"positive"}
{"review":"IT is one of my favorite Stephen King novels I've ever read.  Possibly in the top 10 of all my favorite books.  It is extremely long and I must admit that I had to take breaks during the reading of this novel to get few quick reads in but this book was worth it.  I know it's cliche to say so but the movie does this book no justice.  Of course a movie that would do it justice would most likely be a week or so long. This novel has some of the best character development I've ever read and the reader gets a chance to really get to know each character.  Even a chance to know more about each character that you might care to.  Highly recommended even if you aren't a King fan","domain":"books","label":"positive"}
{"review":"When I first read this book, upon finishing it I immediately proceeded to rip it's 1000 pages up into several tens of thousands of little pieces. That was how much the story affected me. It disgusted me, it disturbed me, it ... moved me. After brooding about it for a few weeks it occurred to me that any writer that could move me to do something like that has really messed with my head, and if that's not the mark of a great writer I don't know what is. I then had to go out and buy another copy and read it again. Amid all the horror that Stephen King has unleashed from the darkness of his imagination, this has to be the most disturbing, disgusting and, at times, offensive work he has ever set to paper. Forget the movie... this is high octane writing which will leave you gasping for breath. With this book and \"The Tommyknockers,\" Stephen King has proven that he is not just a great horror story writer, but a GREAT writer... period. Buy it, read it.","domain":"books","label":"positive"}
{"review":"Although I'm only 14 year old boy who lives in Utah, I've been a die hard Stephen King fan since I was twelve, and I have to say, this is really the high light of his career. Don't be turned off by the massive length of this book, it goes by very quickly, and you'll be glued to it bye the first fifty of so pages. As I'm sure you know, this is a coming of age story about seven children who together must face an evil that has plagued them and even gives them personal grudges. Other people have already gone over the basic story, but one thing that most of them failed to mention that I find very important is that after their child hood encounters with it, all of them But Mike Hanlon lose every memory they ever had of it. Yes, this book is vulgar, it is violent, and there is some sexuality, it is an essential part of the story. It is over a thousand pages long, and each page is genius. I will go to my grave saying that this is the greatest book I've ever read, because it's so much more than a horror story. I think this book has greater characters than any other book I have ever read. This is a five star book, and is almost completely flawless. This is my favorite book, and some of Stephen King's other great works are The Dead Zone, Misery, The Shining, and Christine. Read this book, it is well worth your time, I won't go in depth into the story, because hundreds of other people already have, but this book will scare the piss out of you, make you reflect on your childhood and the friends with whom you shared it, and really just change you. I can't express in words how great this is, but don't take my word for it. Buy it, rent it, whatever, just READ IT (no pun intended). ~Love, Dallas~","domain":"books","label":"positive"}
{"review":"Wow, what an epic. The book draws you in to the sinister world of Derry Maine so quickly, and deeply, that you don't want to leave when the last page is read. With a book so large in volume and scope each reader is bound to find faults with the story, but this world is so full of rich characters, these problems disappear into the pages and eventually vanish. I originally read this book in High School.  After my first re-read 15 years later, the horror of the what goes on in the town of Derry every 28 years had a bigger impact on me.  However, the adventure and wonderment I pulled from the story then, came flooding back again.  The first half of the book is a coming of age story, with evil stalking the town as a backdrop.  The second half of the book is a story of re-discovery and responsibility, with evil lurking closer in each character's shadows. Just a fantastic book that reminds the reader of the power we had as children","domain":"books","label":"positive"}
{"review":"A book that enables you to travel back in time...back to 1958, back to a time when there was Stan, Mike, Richie, Bev, Eddie, Ben and Big Bill and some others...back when some kids' main concern was avoiding Henry Bowers! A story that, although long...over a thousand pages and in 'IT' years probably much longer, kept my attention throughout. Maybe you'll remember what it was like to cycle so fast that your feet lose contact with the pedals...the determination and camaraderie of building a clubhouse, the friendship and love that can overwhelm you when you least expect it to and the fear...fear of the unknown...and fear of the known. A chilling yet absorbing novel that takes time to aquaint you with the characters and their experiences, so that you really care what happens to them - good AND bad!","domain":"books","label":"positive"}
{"review":"The book has a wealth of information on a number of chronic disease processes and alternative medicinal treatments. The section on arthritic diseases contains much valuable information. For instance, Dr. Null explains the many benefits of chelation for capillaries and general wellness. Chondriatin Sulfate is helpful for both arthritis and osteoarthritic conditions. The restorative foods; such as, fruits and veggies will help to ease these conditions and maintain health. The green lip mussel, pure spring water, rhus tox (musculoskeletal disorders), mind/body relaxation techniques, rolfing and the Alexander technique for cranial balancing are cited to relieve the debilitating aspects for a constellation of arthritic conditions. A high fiber diet is another condition precedent for maintaining colon/gastrointestinal health-key to maintaining wellness to combat arthritis. I've found that the fruit/veggie and high roughage diet is helpful for arthritic conditions together with other supportive therapies. i.e. magnets, colonics, acupuncture, chondriatin sulfate and related derivatives. Sugar and excessive gluten must be eliminated to make the diet component work properly. Daily exercise and professional help from a physical therapist will be extremely helpful to refine the treatment methodology and regimen. Eliminate high fat foods, bad cholesterol, white sugar, heavy oil cooking and too many processed food groups in order to facilitate overall health. Too much acidity is another aggravant for sufferers having arthritic/musculoskeletal conditions. Stress reduction and relaxation will help cement a steady management of the arthritic disease processes. In my own experience, successful arthritic condition management consists of a considerable program implemented consistently over a permanent time frame. You can't have 12 cups of coffee with sugar additives each day or a pound of macaroni a week and hope to combat arthritic conditions successfully. Eliminate smoking because the toxins in cigarettes are absorbed by the body-perhaps with permanent residual side-effects. It's important to keep abreast of the rheumatology profile  i.e. SED Rate and blood inflammation indicators  i.e. C-reactive protein. These indicators are a pointer to more profound trends in the body chemistry which require treatment or a special anti-inflammatory protocol and/or dietary change. This volume is not a cure-all. Nothing is a cure-all for middle- aged arthritis. Successful symptomatology management and a cessation of disease progression is the ultimate treatment goal. Emcellular transplantation has been shown to have positive aspects with some risks; however, the procedure is limited to a few clinics outside the United States. Over time, the U.S. will have experimental protocols on board. In the interim, disease management of symptoms and progression is the ultimate treatment goal for arthritic conditions. Some authors discuss a gut permeability linkage to arthritis and derivative conditions. The work provides helpful protocols for implementation by the general public. Some of these protocols have been published extensively in peer-reviewed journals. i.e. The Lancet Dr.Null gives credit to some well-known protocols in the citations toward the end of the book. His works contain a variety of protocols. Some are proprietary to him. Others are well known through peer-reviewed journals  i.e. The Lancet Another group of protocols are specific to popular disease management in India, Asia and indigenous cultures. The book would be a valuable asset for any personal medical library. The September 2006 new edition is eagerly awaited","domain":"books","label":"positive"}
{"review":"Once again Gary Null \"Phd\" recycles information into another GN book with his one size fits all vegeterian diet and vits and supplements. Gary Null is probably the only author that carries a Phd and fails to reveal where he got his BA, MA and Phd. A quick reading of Quakwatch.com shows that Gary Null has  \"nontraditional\" credentials and owns a multi-million dollar supplement company. He also sells everything from magnets to water and air filters. The confusing thing is why someone consuming a nutrient dense diet of organic vegetables, fruit and legumes would need supplements at all. The only reason I could think of is it is a bait and switch technique since most people unable to continue any diet that is restrictive, time consuming and costly give up. So GN conveniently has dozens of vits, supplements, and food replacement products to fill in the gap. I estimate the cost of following GN recommendations in full it would cost about $600 per person a month. To prove my point GN for decades has been against chocolate but recently he has added a GN \"healthy\" chocolate bar to his portfolio. Gary hooks people in by promising the fountain of youth and eternal life. Interestingly this 60 plus year old finds it necessary to put a old stock photo of himself in his books.","domain":"books","label":"negative"}
{"review":"My grandmother was diagnosed with early onset Alzheimer's disease.  This crippling disease was robbing her of her memory and daily life.  Now, 2 years after her diagnosis we discovered Gary Null's &quot;Get Healthy Now!&quot; This volume functions as a valuable tool to reverse her condition and take back her life.  We have followed Null's natural, healty regimen and have witnessed remarkable results.  She no longer struggles with this debilitating condition.  We are grateful to Gary Null and his work.  My grandmother can now enjoy everyday pleasures as she once did","domain":"books","label":"positive"}
{"review":"Let me first say that I am an unlikely reviewer to be so hostile to this type of book; I am extremely committed to healthy food choices, environmentally sound policies, and all the basic values Gary Null ostensibly embraces.  I have no problem with Null's basic premise that we should consume a fresh, non-processed, plant-based diet(although some studies have concluded that those who supplement their food with some fish and dairy products are healthier), buy organic food when at all possible, and avoid toxic household products.  But I am totally outraged by Gary Null's voodoo nutrition approach to these legitimate issues.  I bought the book and promptly returned it because it was so filled with woozy-new age drivel and devoid of reliable references to support the more controversial points.  We don't need any more evidence that a plant-based diet low in trans-fats is healthier than eating at McDonalds.  This book adds NOTHING legitimate to the basic health information you can obtain from any reliable print or internet source, and is far inferior to, for instance, &quot;The Food Pharmacy&quot; by Jean Carper, in which virtually every statement of fact is supported by one or more scientific references.  Save your money and buy some nice fresh organic produce","domain":"books","label":"negative"}
{"review":"I eagerly awaited this next installment of the Artemis Fowl series.  Would Eoin Colfer handle success and continue to put his best effort forward?  YES!  This book exceeds expectations.  I recommend it to all ages.  If you like humor, a fine plot deftly woven, beautifully written prose with a philosophically rich sub plot this book is for YOU","domain":"books","label":"positive"}
{"review":"It was great can not wait for his next boo","domain":"books","label":"positive"}
{"review":"Artemis Fowl is back (finally)! I was terrified that my favorite Irish billionaire genius teenager was gone for good because author Eoin Colfer has been publishing a variety of books in the last couple of years that had nothing to do with good old Artemis. But, fortunately, the boy genius hasn't been forgotten. He's back and more brilliant than ever in this fifth installment of the high-tech fantasy series. As THE LOST COLONY opens, Artemis is fourteen years old and experiencing the uncomfortable pangs of puberty. While that alone is enough to keep most teens busy for a few years, Artemis has to contend with his surging hormones while trying to save an entire fairy race as it teeters on the brink of extinction. But it's that kind of multitasking that has made Artemis Fowl an international sensation. THE LOST COLONY has all the elements that Fowl fans have come to expect, including a dizzying array of fairy-issue gadgets, danger whizzing past our heroes from a variety of sources, ingenious plans, and a bodyguard who is as loyal as he is lethal. This book also includes a few new characters who were, for the most part, likeable and fun. The one notable exception is a twelve-year-old French girl who could give Artemis a run for his money in the genius category. She is pretty, rich, and highly annoying. I often found myself wishing that one of the other characters would \"accidentally\" dunk her in a sewer, or shave her head, or something equally unpleasant. Is it wrong for me to have feelings of aggression toward a fictional character? No, I don't think so. And you'll understand what I mean once you read the book. Fans of the ARTEMIS FOWL series will not be disappointed in this newest adventure. There were a few problems with the story, including some hard-to-follow descriptions of how Artemis and company escape their latest predicament, and an irritating French girl (see above). Overall, though, I found this an enjoyable book with an ending that knocked me for a loop. And, as always, I was left wondering what mischief Artemis will dream up next. Reviewed by:  K. Osborn Sulliva","domain":"books","label":"positive"}
{"review":"This movie exemplifies what was good and what was bad about Hollywood in the 1930's.  The good part was that they could take a major work of contemporary literature and convert it into a major motion picture.  The good was that they could create special effects like the swarm of locusts attacking the fields.  The good was that they could adhere to a code of standards that enabled them to suggest sexuality without showing it.  The good was that they could make a moral statement without hitting us over the head with it. The bad was the fact that they used Caucasian actors to play the leading Oriental roles.  Paul Muni never came across as an Oriental of any nationality and no amount of make-up was going to make it happen.  Luise Rainer came off fairly believable but to have Uncle Henry from \"The Wizard of OZ\" playing the venerable father was too much.  The problem that Hollywood had for years (and, to an extent, even today) was that they couldn't seem to accept non-Caucasians in leading roles.  Orson Welles plays Othello, Peter Lorre plays Mr. Motto, Anthony Quinn plays an Eskimo in \"The Savage Innocents\", Ricardo Montalban plays a Native American (and, in a bizarre twist, so does Woody Strode), Ben Kingsley plays Gandhi, and on and on and on.  I realize that the attitude is that a big name helps sell the movie but why not let an Oriental play an Oriental, a Native American play a Native American.  I don't think it was a lack of talent.  I suspect it was a lack of interest. Having made those points, I would conclude by suggesting that \"The Good Earth\" is about 20-30 minutes too long but it is otherwise a very good picture.  I believe that Luise Rainer was awarded the Best Actress Oscar for her role as Olin and I came away impressed that the award was well earned.","domain":"dvd","label":"positive"}
{"review":"Boy meets girl. Girl thinks boy is a little weird but interesting. Boy is mildly taken with girl. They part with a classic kiss that screams spontaneity. They meet again under circumstances that they can't have each other and the girl doesn't know what she wants, she's just irritated by boy. I won't ruin the ending, but it's a good one. This has nudity in it; my husband thinks I watch it to see Julian Sands in the buff. He might be right","domain":"dvd","label":"positive"}
{"review":"This has to be one of the best romantic movies ever filmed. Merchant and Ivory were masters at period films. The music, acting, locations, costumes were first class. One of my favorite movie scenes of all times is the playful scene of the vicar and the two young men frolicking buck naked in the pond in the woods. I laugh out loud every time I see the movie. There are so many brilliant moments in this movie, I never tire of it. I've had the video for many years, so, I had to have the DVD","domain":"dvd","label":"positive"}
{"review":"When I watched this film for the first time several years ago, I thought it was mind-numbingly boring.  Now that I've become a big fan of film adaptations and, more important, period pieces, I thought it would be fair to give this film a second chance.  A Room with a View is a beautiful, passionate love story that keeps real to E.M. Forster's novel.  This is the story of Lucy Honeychurch (Helena Bonham-Carter) and the choices she has to make.  Should she choose her boring, but socially approved fianc� Cecil (Daniel Day-Lewis) or should she follow her heart and choose the adorable and passionate George (Julian Sands), whom she met during a trip to Florence, Italy?  Should she settle for the demands and social mores of Edwardian England? The story is slow-paced and subtle.  It focuses more on the decisions Lucy has to make.  Some people may consider it boring.  I, however, think it is one of the best love stories out there.  The actors are all magnificent.  Helena Bonham-Carter, Daniel Day-Lewis and Julian Sands are wonderful.  The scenes where the men bathe naked at the lake is my favorite scene.  Yes, there is explicit male nudity in this scene, but I like the fact that they show men frolicking in such an innocent way.  I thought it was endearing and the acting wonderful.  As for the rest of the cast, Judi Dench and Simon Callow are also great.  The production is an eyeful.  The wardrobe, sets, scenery (especially the scenes in Italy) and backdrop of the Edwardian period (this is not a Victorian, like other reviewers have said) are breathtaking.  James Ivory and the BBC went all the way with the quality of the direction and production.  This movie was released in 1986 and the DVD's digital remastering is excellent.  It adds dimensions to this already beautiful film.  If you love classic love stories and you're a period film enthusiast, I recommend A Room with a View.  Only a true lover of the aforementioned things could appreciate this great film to the full","domain":"dvd","label":"positive"}
{"review":"See title; simply put, it's a charming film.  Loved it - a very successful gift","domain":"dvd","label":"positive"}
{"review":"The mid-1980s was a banner time for E.M. Forster fans. Two of his novels, \"A Passage to India\" and this, \"A Room with a View\", were successfully and wonderfully adapted for the big screen. (\"Howard's End\" would come a few years later.) Forster had a genius for developing characters and for showing the awesome and sometime awful complexities that arise when people interract. James Ivory, thanks to a brilliant casting director, had the right actors to bring these characters to life on the screen: Helen Bonham Carter, Maggie Smith, Simon Callow, Julian Sands, Daniel Day-Lewis, etc. What this permitted Ivory to do was to focus on another equally important element in film making: to give us something beautiful to look at. The shots of a small Engish village, the lusty Italian countryside, the polish of an upper class English garden are nothing short of breathtaking. It enhances the romance, heightens the humor (especially when an English minister decides to skinny dip with a few parishoners in a hysterical scene), and convinces us that this was how life was for these remarkable characters. One of the Merchant-Ivory's best collaborations, this dvd also comes with some insightful commentary and a unique look at E.M. Forster's life. I recommend it highly","domain":"dvd","label":"positive"}
{"review":"This is one of my top ten favorite movies of all time.  It's funny and beautiful, with a perfect cast.  The music and the scenery is breathtaking.  I agree with a previous reviewer, I can't think of anything that isn't perfect with this film","domain":"dvd","label":"positive"}
{"review":"This has always been a favorite movie of mine-- enchanting, visually stunning and superb acting. But I have to say, I think that the digital remastering takes some of that enchantment away. At least with the audio aspect. Actor's voices have lost the human richness-- esp the women's voices which sound higher pitched and slightly annoying. Even the music and sound effects sound a little \"off.\" So, it was sadly less of an enjoyable, enchanting experience for me watching this version. That said, I still love this movie, so I'm giving it 4 stars (minus 1 for the bad remastering). But this is just my opinion, so feel free to take it or leave it. Cheers","domain":"dvd","label":"negative"}
{"review":"I love this movie. For my 15th Birthday, My mom ordered it for me:) The Video Store lost the order and it took them 6 months to get it to me on VHS. Does that tell you how long I have loved this movie!!! I know the movie word for word!! Most Men do not understand it, (it has no action, DUH!!). It does not need it! It is beautifully written and the background (Italy, etc.) is perfect!!!!!!!!!!!! I have a wonderful dream to fufill on day - To run through a barley & poppy field dressed in  a victorian dress and carring a parasol:) I love the way Helena says the word Constantinople. It will be my daughter's name. Also the costumes and Hair in the movie is incredable!! For my wedding I had the hair of the Italian driver's girlfriend. I am a long haired blond, so it worked out perfectly. Helena still and always will be my favorite British Actress. This movie moved my in many ways and I even after almost 15 years nothing compares to this movie in my opinion!! Enjoy!!!! If you are a romantic at heart let the romance take you away for a few hours:","domain":"dvd","label":"positive"}
{"review":"I would have given this film 0 stars if possible.  This film was long, boring, and painful to watch.  If you like Jane Austen films or other BBC period films, do not be deceived by this one; it is nothing like those types of films","domain":"dvd","label":"negative"}
{"review":"These movies are just total nonsensical rubbish about mutated babies.  From a horror movie fan's perspective, I remain completely unimpressed with the merits of these films and that includes the original, \"It's Alive\".  The only thing about babies (mutated or not) that scares me is having to change their diapers...it stinks and this entire trilogy stinks too!  What a worthless...waste","domain":"dvd","label":"negative"}
{"review":"In my review of 'It's Alive' I noted that that film was surprisingly serious and low-key for a film about murderous mutant babies.  The same cannot be said for these two movies.  However, they're highly entertaining, so between the 3 of them we get a bit of everything.  This is some very entertaining schlock horror right here.  Can't imagine why it isn't more popular. 'It Lives Again' is the better of the two here, and probably the best of the series.  This is a direct sequel, as the killer baby epidemic is spreading and the government has resorted to immediate execution.  Frank Davis is back with a number of sympathetic doctors and scientists, and is working to save the children.  This time there are 3 babies, and there is a whole lot more baby mayhem.  Though they're still occasionally conspicously absent from the frame, you see a whole lot more of the kids this time around.  Obviously, they are rarely at all convincing but I think they look neat and seeing the babies maul someone is always a treat.  There's still quite a bit of downtime, but Frank is still entertaining to watch, so it doesn't hurt it all too much.  He's getting pretty obsessive and nutty by now, but I still sympathize with him.  This time around the whole thing seems a lot wackier.  Now they've got whole legions of cops waiting for the babies, and watching them search the hillside and lengthily discuss baby-hunting strategy is just very amusing.  The film is hurt by the fact that the ending is a bit to reiterative of the original.  Seems a little lazy this way, but it doesn't matter too much. Grade: B 'Island of the Alive' is easily the weakest of the series, but it's still entertaining and deserves some credit for trying something new.  It starts Michael Moriarty as Jarvis, an actor who fathers a mutant child, and fights to have them saved.  After a hilarious and awesome courtroom scene involving a stop-motion animated baby it is decided that the killer babies will be banished to some jungle island.  The film focuses on a few years later where there is an expedition to see how the babies have grown.  This points to the central problem-- The babies are all grown up throughout the climax of the film, so they're basically just monster people.  That is much less appealing.  Still, there's quite a bit of baby action at the beginning, and it's the best stuff of the series.  There's a sequence where a pack of hired guns go out to wipe out the babies shortly after they're placed on the island which is absolutley priceless, culmnating in the final survivor fleeing in the helicopter only to find that, dear God!, there's a baby already inside which leaps on him from behind.  Also, then the helicopter explodes, for no apparent reason.  As with all the Cohen monster films I've seen this movie has got a lotta talking, focusing largely on Moriarty's wacky, twitchy and crazy performance.  I find him fairly amusing, but he's definitely on display too much.  The film is also helped by a fair bit of gore, but the overall relative absence of the babies reduces the charm of the film substantially. Grade: C+ Yeah, this disc is definitely worth at least a rental.  At this low of a price I'm sure I'll pick it up sooner or later, actually, but ya certainly oughta see it at least once","domain":"dvd","label":"positive"}
{"review":"It's ALive 3: Island of the Alive is down right hilarious. Nothing is better than watching mutant babies grow up and eat people. I mean seriously. My personal favorite scene was the court room scene with the \"baby\" in the cage. Good laughs. In this flick, Michael Moriarity portrays a father of a mutant \"baby.\" The government decides to put the lil' suckers (theres five or so now) on an uncharted island. Five years later, they decide they need to get \"fluid samples\" off the creatures for scientific research. Michael Moriarity goes along for the ride. Well the \"babies\" have grown into five year old \"adults.\" And one of them has had a baby of their own. Yes indeed, Moriarity is a Pappy. All is well until they all die. Except Moriarity. The monsters want to get back to civilization and Moriarity gets stuck with the job of taking them there. Somewhere along the journey, they chuck him out into the ocean, Cuba picks him up, he gets back to the states, bla bla bla. All in all, this is a funny movie that deserves a four star rating on a B-movie scale. Watching this movie alone is like getting beat to death by golf clubs, but watching it with a bunch of B-movie lovers is a riot. If you liked \"Island of the Alive\" I recomend: the awesomely bad movie \"Creature,\" it's sci-fi on drugs and totally funny. What I learned from Island of the Alive: Cuban officers are nice AND funny","domain":"dvd","label":"positive"}
{"review":"They're cute! They're cuddly! They'll rip yer head off! In IT'S ALIVE, the Davis baby ran (crawled) amok, leaving bodies strewn in it's frenzied wake! Larry Cohen's saga of babies gone bad continues with this double dose of pernicious pablum! IT LIVES AGAIN has Frank Davis (John P. Ryan) crashing a baby shower to deliver the bad news that the expectant parents (Frederic Forrest and Kathleen Lloyd) are about to hear the pitter-patter of little murderous-mutant feet! If that's not horrid enough, the government is watching and waiting for it's chance to swoop in and make things even worse! Mr. Mallory (John \"horses-head-in-the-bed\" Marley), leads a team of operatives bent on mutant infanticide. Frank must get the young couple into hiding at a secret facility before the inevitible bloodbath. Check out the delivery-room on wheels! Slower than the original, but good enough for repeat viewings. ISLAND OF THE ALIVE opens with the infamous taxi-cab delivery scene. Then, we shift to a father named Stephen Jarvis (Michael \"Q-The Winged Serpent\" Moriarty) fighting in court for the life of his caged son. The judge decides to spare the creature, and an island is found where it and others of it's kind can live in peace. Well, of course, invaders arrive to hunt down and kill the babies, only to become so much baby food themselves! Finally, another team is sent to \"study\" the lil' devils, who have all grown up into big ol' cannibals! Mmmm! It turns out that the \"kids\" have a plan of their own! Karen Black (Trilogy Of Terror, Burnt Offerings) stars as Jarvis' ex-wife, Ellen; who just wants to forget the whole \"killer baby\" thing. I love this one! Much gorier than the first two. This is a great double feature! Grab the first one too and complete the trifecta...","domain":"dvd","label":"positive"}
{"review":"When watching the third X Men movie, one cannot help but wonder if Bryan Singer was involved in the movie.Brett Ratner does a credible job on his contribution to a movie franchise that Singer defined. The movie is loaded with great action sequences,new characters,plot twists and and resolutions.Unfortunately at 105 minutes it crams in too much when an over two hour screen time would better service under developed elements(The Phoenix,and the off-screen death of a beloved X-Men)and characters(Angel,Beast,Juggernaught,Rogue). The endings leaves the door open for this not to be the \"Last\" stand of the cinimatic adventure of the X-Men","domain":"dvd","label":"positive"}
{"review":"The first X-Men movie was fantastic. The second movie sent chills down my spine and was even better. This third movie was absolute trash and I will never buy it","domain":"dvd","label":"negative"}
{"review":"In \"X-Men III The Last Stand\" the government has found a 'cure' for mutants, and are more than happy to help make them normal humans.  Of course Mutants from both sides of the fence do not like the idea of becoming cured, many do not see it as a disease.  Of course Magneto (Ian McKellen)dose not like this idea and raises an army or rouge mutants to fight the government program.  Meanwhile Jane Grey (Famke Janssen) is back, though as psychotic Phoenix.  Xavier (Patrick Stewart) tries to help, but is unable to reach her; and Wolverine (Hugh Jackman) has less luck, and a tougher decision. Many loose ends are tied up, and things conclude, so I am inclined to think this may be the last X-Men movie (though spin offs are more than likely).  This film had a darker edge to it due to it's near Nazi-like idea of what the 'normal' people are curing.  The action was really wild and great, you'll never be bored, that's for sure.  And it also gets you at the gut too, as a few loved ones depart.  The acting is about what you'd expect, good for a huge CGI driven spectacle movie.  While Wolverine is still the focus the cast is so large that he slightly gets pushed to the side often with new characters like Beast, Jurganaught, and Angel, just to name a few. I like this film a lot, it was a lot better than the other comic book movie this summer, that's for sure","domain":"dvd","label":"positive"}
{"review":"Xmen III is one of the best movies ever!! The intense battle between the different philosophies of Xavier and Magneto is at its peak in the last Xmen movie The Last Stand, a tale of survival.  This movie emcompasses all genres such as politics, action, romance, comedy, drama, horror, etc...this movie has something for everyone! From the politics of the Cure, to the forced suppression of the Dark Pheonix of Jean Grey, the internal conflict between right and wrong surfaces throughout this thought-provoking movie.  Not only is the storyline beautifully philosophical, the actors and actresses express their emotions with perfect intensity.  With the perfect combination of story telling and presentation, one can understand both perspectives, whether it is for Xavier or Magneto. This movie is nothing but perfect.","domain":"dvd","label":"positive"}
{"review":"The third installment of the very successful mutant franchise ends with a very loud bang! Filled with more action and special effects that you could ever hope for... no to mention all the mutants they could cram in 2 hours.  This was a very good movie, if you can set aside the fact that it has no plot whatsoever.  XMen hardcore fans may be disappointed of the complete alteration of the Phoenix Saga... and of the complete moron the Juggernaut is turned into. The good: Many incredible fights and battles. Beast rules! The bad: Not a very interesting or profound plot. Juggernaut sucks!","domain":"dvd","label":"positive"}
{"review":"A cure has been discovered to help mutants be normal if they chose it, unfortunately it has made Magneto (Ian Mckellen) furious as hell as he recruits some of his deadly mutants to put a stop to it. Jean Grey (Famke Janssen) whom thought she was left for dead in the previous picture has been resurrected but filled with dark powers as the powerful and evil Dark Phoenix as she joins up with Magneto to enslave humanity once and for all, but can Charles Xavier (Patrick Stewart) along with the X-Men (Hugh Jackman, Anna Paquin, Halle Berry, Shawn Ashmore, James Marsden) with three new members Kitty Pryd (Ellen Page), Beast (Kelsey Grammer) and Angel (Ben Foster) stop the war from happening? This is the final installment of the popular \"X-Men\" trilogy, the film is kind of weak compared to the awesome first two installments. But there is plenty of good action sequences, some humor, more wolverine action, emotion, and new mutants like Juggernaut (Vinnie Jones) as the director of \"Rush Hour\" Brett Ratner takes over Bryan Singer's spot for director to take this final installment to a new direction. It's a weak but very good end to a great Marvel comic movie series until a few character spin-offs come along like \"Wolverine\" and \"Magneto\". This DVD has great picture & sound with some good extras like two audio commentaries and deleted scenes. It's still worth owning if you loved the first two movies or comic based movies","domain":"dvd","label":"positive"}
{"review":"I have had this printer for more than a year.  At first, it was a great printer. Not anymore!!  It uses up ink like no other, yes, it is great to have the individual tanks(which is why I bought the thing) but now the print head isn't working right.  Do several deep cleanings and use up nearly all the full tanks up, and the problem is still there.  The pages have splotchy black marks and the texts are only partially printed.  Went to the canon website, they don't even acknowledge this printer ever existed. My recommendation is don't buy this model!!","domain":"electronics","label":"negative"}
{"review":"This printer prints fast but the quality is poor. Consumer reports rates it a best buy but I disagree. Pictures come out very graney and its almost worthless to have a 2 megapixel or higher camera because the quality will not be seen with this printer. I do not recommend this printer to anyone. I bought the Cannon to replace a Hewlett Packard deskjet 932C and it was slow but the picture quality was superior to the Cannon. This purchase was a real dissapointment","domain":"electronics","label":"negative"}
{"review":"I purchased this printer with the intent to use it for both photo printing and regular text printing. Photos look great and print relatively quickly, but I had a problem with white streaks when printing text. I ended up calling Canon support and they sent me a new printer head for free since the printer is still under warranty. I've had no problems since. I give the printer a high rating mainly because I was very satisified with their tech support","domain":"electronics","label":"positive"}
{"review":"I have had nothing but trouble with this product. no matter how many times i have dowload new, or older, drivers, the installation is never complete. their help desk neither has been able to provide with any help to this problem (though they have tried). i will not spend money on another dlink product","domain":"electronics","label":"negative"}
{"review":"My brother has the Netgear WG511T Super G 108 PC Card for his notebook and it works great.  So after I thought my Dell notebook internal wireless chip died, I decided to order a notebook adapter for it.  Instead of getting another Netgear I decided to go with the D-Link DWL-G650 Cardbus Adapter 108Mbps - my first experience with a D-Link product.  The G650 works great - plugged the card into the adapter slot, turned on the notebook, 5-10 minutes configurations and WOLA I got on the internet.  The card works flawlessly without any signal dropped or any compatibility problem with my Westell 327W router.  I notice the wireless signal is stronger and the connection is faster than the notebook internal wireless adapter or the WUSB12 Linksy adapter which I used prior to obtaining the G650.  The G650 supports WEP, WPA, WPA-PSK security encryption and comes with an intuitive and easy to use configuration utility","domain":"electronics","label":"positive"}
{"review":"I couldn't find this adapter locally, so I turned to Amazon.com.  Naturally I found it.  The price was right, I received the advertised rebate, and the product works as advertised.  What more can you want","domain":"electronics","label":"positive"}
{"review":"All, I Have used this card to connect to various routers and it works well. The Extreme G mode is problematic to enable sometimes. New drivers are available, make sure you down-load the right one. D-Link how about having an automatic update command ?, instead of letting the user figure out which card version he has ?. / Bria","domain":"electronics","label":"positive"}
{"review":"The main reason I got this card is because it working in Linux (It has an atheros chipset), and it delivers.  It works great, and the range is awesome. For Windows users, it works great in XP as well. Overall, I am very satisfied with this wireless card","domain":"electronics","label":"positive"}
{"review":"I decided to dust off a 5-year old laptop (Winbook Z1) the other day and install Ubuntu on it. I selected this card because of the Atheros chipset. I can't believe how easy it was to get it working. I plugged it in, installed Ubuntu and the new OS recognized the card. With in minutes I was on the internet, thanks to my neighbor's open WiFi. After a few hours of reading some wiki's and messages, I had WPA running and my \"new\" Linux laptop was on my network. Piece of cake! Great card and great chipset","domain":"electronics","label":"positive"}
{"review":"This D-Link wireless 802.11g wireless AirPlusXtremeG adapter is amazing. The first amazing thing, is that it seems to lose your connection all the time. This seems to be because of some problem D-link has with \"Authentication\". If you want yours to work, turn off authentication. Once you have it running reliably, it is amazingly fast. I run on a cable modem and get about 1.1 megabytes per second on a wired connection normally, and yet I have exceeded that with my AirPlusXtremeG (about 1.15). My point is that it works like a wired connection without the hassle of wires, but with the added hassle of needing to set it up EXACTLY right. This doesn's seem to be a problem if you don't use security, but with security, be prepared to visit at least one forum for tips on set-up. I recommend [...]. They have many people who are experienced with this adapter and the routers that are used with it","domain":"electronics","label":"positive"}
{"review":"This is very well designed. It give you 4 USB Port but two on opposite sides. This is very clever becase you have plug in devices from both sides. You webcam or cell on your left and your mouse and number pad on your right. The cord that plug in from the Hub to the Computer is very sterdy yet flexible so you can not only adjust the Hub in all kind of angles, it would stay at that angle and not twist all around you wires. It also works great if you jsut want to charge you USB devices on the go. It come with a plug in AC adapter so you don't need to bring your computer along with you to charge youd devices","domain":"electronics","label":"positive"}
{"review":"I,ve seen complaints about the ac adapter you \"must\" plug in. Hey guys, try it without an outside energy source, I just hope I,m not gonna fry something but it seems to work fine just plugged into a powered USB port. I have a VERY high end system though with wattage to sprare, but no more PCI slots, Damn 7900 512 gtx graphics cards, why do 2 of em have to take up so much room. Oh well, trade offs are a bi---, but a reality and 7 extra USB slots are awfully nice","domain":"electronics","label":"positive"}
{"review":"It's speedy and space saving and inexpensive. I bought this to replace my Belkin because the Belkin needed to be plugged in. This one is powered by your computer so there's no extra power cords, which is a big plus to me. The only thing I dislike about this is the fact that the Hub takes up two Usb ports instead of just one like the Belkin.","domain":"electronics","label":"positive"}
{"review":"PROS Small Cute Self-powered - comes with a power adaptor.  I have 6 devices hooked up to it, including 2 USB Hard Drives, and it works fine without the adapter - a big plus for me. Most hubs would not work with this setup. USB 2.0 & 1.1 - 6 devices hooked up, 3 low speed and 3 high speed, all work very well. Runs cool. CONS Not sure why, but they put the 7 ports on one side of the hub and power/uplink ports on the other.  This is dumb.  If you have the hub on a desk it looks awkward.  All ports should be on the back and leds on the front.  Here, the leds are next to each port which makes them completely useless as you don't see them. The hub is very light so when you have lots of devices hooked up the font gets a elevated. Overall, the best hub I've ever had and I tried many","domain":"electronics","label":"positive"}
{"review":"It's a simple device, so there's not to say about it other than it does the job. You should note that the LEDs on the device remain lit as long as the device is plugged into your PC and the PC is powered (they glow a bright blue).","domain":"electronics","label":"positive"}
{"review":"You will appreciate this product only if you don't have enough USB ports. In my case, I had plenty of ports, but needed an extension cable, which would help me in plugging the flash drives, whithout bending down and plunging into the cave of wires(I keep my CPU, under the table).The only complaint I have is the the wire lenght is not long enough. Overall good value for price","domain":"electronics","label":"positive"}
{"review":"This hub takes care of old power issues I had with smaller (unpowered hubs).  It is handling my pda, usb jump drive, high capacity external drive, and printer.  And I still have 3 more ports.  And I haven't had any USB power alerts from my computer since I added this hub.  It does what it says","domain":"electronics","label":"positive"}
{"review":"I have been using the Sansa mp3 player now for almost a year. It's a great item, especially for the price. Was very easy to download my music and set up. I purchased a better brand of earphones, seeing I would be using mine mostly on an airplane. It holds more than enough songs. I am going to purchase one for my granddaughter for her Christmas present this year","domain":"electronics","label":"positive"}
{"review":"As you have read other reviews, the earphones could be better, sometimes you will hear music out of both, sometimes one or the other.  The only issue I have with it, is if someone downloads music on to it with another computer, you cannot pull the songs off with your computer.  Maybe I am missing something or doing something wrong, but over all it's not bad.","domain":"electronics","label":"positive"}
{"review":"I purchased the Sansa (512MB) player for a hinking trip and I have to say it works GREAT. The only complaint that I would have is that the unit is a bit bulk for todays standards, but not to bad. If you are looking for a no-frills MP3 player than this unit is a great value! Plus it comes in larger memory sizes and a built in radio to boot! The single AAA battery that the unit takes goes a long way too","domain":"electronics","label":"positive"}
{"review":"I originally bought one of these for myself and was so delighted with it that I ordered 3 for friends as gifts.  I find the Progressive International Onion Chopper easy to clean (it comes with a small tool to help clean the grate)and extremely efficient.  I have always disliked chopping onions, apples, mushrooms, tomatoes and the like but this has made this tedious (and sometimes odious)task quick and easy plus the base measures the amount you have chopped so you know when you have reached your goal.  Just place a slice of onion, or whatever, on the metal grate and push down on the lid (I will admit, sometimes it takes a bit more effort than others when you are attacking a thick slice of something but it is not too difficult) and your onion is chopped with a minimum of tears and no nicked fingers from cutting too close to your digits.  I highly recommend this timesaver for anyone who spends any time in the kitchen cooking.  I love it","domain":"housewares","label":"positive"}
{"review":"I dislike dicing onions and dislike even more paying the price for ready diced onions.  My family eats a lot of salsa and I use lots of onions in my cooking so finding this chopper has made my time in the kitchen easier. I peel and quarter a large onion and the chopper works great. The tiny square dice is something I'd never be able to do with a knife.  I didn't have to push very hard but my daughter had to put it on a chair seat to push all the way down.  You have to push on the end of the chopper not in the middle.  It cleaned up quick, I rinsed it under hot water right after use, didn't even need the cleaning tool.  So far I've chopped several dozen onions and no problem.   I didn't buy mine from Amazon thought.  I found it at a dept. store.","domain":"housewares","label":"positive"}
{"review":"I wanted to have an onion cutter that would make my life easier. after buying  this i found that it was tough to use. I had to apply all my body weight to cut onion. 2nd day , it broke. It wouldn't cut even small pieces of white onion when they are little slimy. It wouldn't cut tomatoes or bell paper , as written in one of the reviews Don't waste your money","domain":"housewares","label":"negative"}
{"review":"My family makes and freezes four huge pots of spaghetti sauce every 3 or 4 months. The recipe calls for 3 large white onions to be chopped up for each pot - the most time consuming part of the ingredient prep phase. For the last batch we made, my wife pulled out this onion chopping device and said \"try this\". I was skeptical but willing to try anything to avoid chopping up 12 large onions. Well, it worked. I estimate it cut my chopping time in half. I thought I had broken it several times, since you really have to muscle the onion pieces through the blades, which causes a loud bang when the lid closes, but it didn't break. Couple of tips for using this chopper - for large jobs like mine, clean the dicing cubes every two or three onions to avoid mushy dicing. The cleaning comb works well. The pieces you push through the chopper  shouldn't be too large. For a large onion, I found cutting it into eighths worked best. Clear space directly under the blades for each new onion slice to avoid clogging the blades. And finally, place the onion pieces cut side down on the blades - they dice smoother that way. So far, this device beats chopping onions with a knife. I didn't give it five stars since that rating needs to be reserved for a foolproof chopping device that doesn't require so much muscle power. If the Chopper breaks in the future, I'll update this rating and let you know","domain":"housewares","label":"positive"}
{"review":"When I saw this chopper I thought it was a very good idea. It was a good idea if it had only worked as Progressive described it, or if I was 6 ft tall and worked out all the time. I have had to put this gadget on the floor and step on it with my heel to cut even a small section of a small onion through the not very sharp blade. There seems to be inconsistancies as to how sharp the blade is which tells me that there was very poor quality control in the manufacturing of this chopper. There appears to be no middle ground in the reviews. Are we all talking about the same chopper? If you have to cut the veggies into small pieces to make this work, why not just continue cutting with a high quality knife. It's just as fast if you practice a little slicing, dicing and chopping. The amount of time to clean my knife is much less than how long it takes me to clean out the little pieces of onion that stick in the blade and the plastic top! Also, the little non-skid covers on the feet have disappeared, probably into the bottom of my dishwasher.  A waste of $15.00.","domain":"housewares","label":"negative"}
{"review":"I was in NYC earlier this year on business, and I was served an espresso in one of these glasses.  It stayed hot for at least 5 times longer than a normal glass and I immediately bought 4 when I returned home.  I use these every day; they are utilitarian and beautiful - perfect design in other words","domain":"housewares","label":"positive"}
{"review":"I like this holder.  I used to keep my processor parts in a small rectangular, shallow basket.  That made for interesting results when grabbing for attachments.  It is no longer a problem to pull out the needed part.  The only drawback is where to put this, which is more of a personal problem.  I just need to make a spot for it in my overcrowded cabinets. Some have expressed a concern about the latch. It takes a little bit of figuring out, which is a good thing, if you have small children.  If you don't need to worry about that, there is not a need to keep the latch in the locked position.  I am so happy to have at least one appliance for which I can easily find the attachments","domain":"housewares","label":"positive"}
{"review":"Any serious Cuisinart owner/dailer user with their fine array of multiple blades needs a serious storage/accessible medium for those blades. NOT a counter-top \"display\" item! Cuisinart offered and I have two, pricey stands/racks, with no lids or protection yet they calculated the number of discs per rack wrong. Cuisinart should come up with a secure disc-holder to smartly accomodate ALL discs/blades for a given model and which - if it becomes dirty, wouldn't mind a trip through the dishwasher","domain":"housewares","label":"negative"}
{"review":"The blade and disc holder does what it says it will.  It does protect your blades etc. and it is easier on the fingers by not having to store the blades in a drawer.  The only fault I can find with it is that if I move it, the small blade slips out of place.  They could have made that area a little deeper to hold it better.  Other than that, I think this is a good product and worth the money. I have not had any trouble with the locking lid and like this feature","domain":"housewares","label":"positive"}
{"review":"I am very happy with the purchase of this item.  Without it, we had nowhere to store the blades due to their odd sizes.  Also, because of the sharpness of the blades, it's nice to have the child proof opener to prevent any accidents.  I would recommend this product to anyone with similar needs","domain":"housewares","label":"positive"}
{"review":"This device does exactly what I hoped for, provides a safe organized place for the disks and blades on my Chisinart.  My only complaint is that it's too safe!  It doesn't open by simply lifting the lid, there is a slight complication of a lock so that the lid can't be lifted by curious fingers, but in our (older) household it provides the same kind of safety that childproof caps provide: unneeded!  Other than that, it's a great item","domain":"housewares","label":"positive"}
{"review":"This is a nice quality set for the price.  The color is pretty (sorta like celadon with a bluish tinge), the weight is good (not too heavy, not too light), the cups are nice-sized, and the bowls are the perfect size for cereal (not too shallow, not too small).  But note: they add on an additional $5 shipping charge without notifying you first, IN ADDITION to the shipping charges listed above","domain":"housewares","label":"positive"}
{"review":"After some years of satisfactory use the probe with my Polder thermometer/timer would occasionally not read the temperature so I purchased a replacement. Using it to caramelise sugar I found a deep color when the thermometer read only 260F. Switching quickly to the old probe it read 350F!! - about what I expected from the color. Had I been using this probe to heat oil I would not have a color change to warn me and I believe it would have reached the flash point and caught fire before it registered a typical frying temperature. DO NOT USE a replacement probe before you have at least checked its reading in boiling water when it should read 212F. This replacement probe was deceptive because it read fairly accurately at room temperature but in boiling water it read only 179F - already 33F low","domain":"housewares","label":"negative"}
{"review":"Yes, these are based on the same pricipal as practically all other probe thermometers. A thermistor in the tip changes electrical resistance with temerature and the thermometer base converts the resistance to a temperature. HOWEVER...the resistance is not the same from brand to brand.  I purchased two of these probes after one of my two Taylor probes went belly up (my fault: don't leave these in a hot grill).  The room temperature seemed the same - the replacements were maybe a degree or two below the original (66 vs 68). After watching a batch of icecream turn to creamy scrambled eggs at just 150F, I decided to test them to see if one of the thermometer bases was bad. Well, boiling water for the remaining original probe came out at 201 degrees (vs a theoretical 207degrees at my altitude), while the new Polder probes were something like 162 and 163.  A trip to an ice bath showed 33 on the original, and 40 and 42 on the Polder probes. Swithing the probes and bases yielded identical results....so it was a probe \"problem.\" Next, I did a side-by-side (one original Taylor, one replacement Polder) temperature run up in my oven. Both probes were nearly touching, and the tips were suspended near the bottom third of the oven, away from the element.  I ran the temp from 200F to 400F, then plotted the data in Excel. Both probes were approximately linear (close enough for cooking), but the Polder had a lower slope. A simple bit of math and I had a conversion chart for using the new proves. This is not to say that the probes won't work perfectly in a Polder thermometer, but if you're planning on using them in a different mfr thermometer, you would be wise to make a little conversion chart and tape it to the back of the thermometer, or you may not get what you think you're getting","domain":"housewares","label":"positive"}
{"review":"I am on third thermometer unit and have just discovered that I can replace the probe instead of the whole thing.  DUH!  This probe works with my Pampered Chef version.  I also purchased the Acu-Rite BBQ thermometer for use on the grill, smoker and turkey fryer.  Hopefully now have at least one working thermometer at all times","domain":"housewares","label":"positive"}
{"review":"got exactly what i wanted and got it fast.  i just wish they could withstand more than 350","domain":"housewares","label":"positive"}
{"review":"All heat sensing probes wear out - some sooner than others and usually it's misuse of the probe that causes early failure. I own a Miu France Roasting Themometer which is very similar to the Poulter model (maybe even made by the same manufacturer). Anyway I accidentally burned out a 6 inch section of the probe wire in my gas barbecue. So I searched for a replacement probe on the Miu France website and could find none. I looked through the Poulter online catalog and guess what? The Poulter probe is 100% compatible with the Miu France themometer. Then I checked it's accuracy with a laboratory grade Omega digital probe thermometer.The Miu Fance is with 1 degree F of the Omega. And the Omega company recommends buying extra probes for their thermometer because it's real easy to burn the wire connecting the probe sensor to the readout unit","domain":"housewares","label":"positive"}
{"review":"I absolutely love probe thermometers and I've tried all of them.  All of them stink.  The fatal flaw is the probe and they all seem to have probes of about equal quality. I played the \"keep buying probes\" game and I always keep two unopened spares in the cupboard.  Prior to using the thermometer, I always check it against both freezing (ice-water) and boiling temperatures.  If either test fails, I grab a new one. Some probes stink right out of the box as others here have mentioned.  The most recent one, brand new, measured freezing at 43 degrees and boiling at 182 degrees.  Note this is for a Polder probe that had never been used for anything and had never been exposed to high temperatures (i.e. I just dipped it into boiling water, I did not let it sit in the pan while the pan heated). Probes that do work new will generally last for half a dozen uses or so.  Yes,they will fail in the middle of cooking so it might measure fine when you start and then suddenly decided to be off by 30 degrees. I do have one probe that has lasted for over six months (perhaps 20 uses), so it seems like once in a while you can get a good one which is why some people report no problems.  I've only got one of those out of eleven and I keep hoping to find more. If there's a handier device in the kitchen, I don't know what it is, but the quality of these things is dismal.  If you can afford to keep buying probes and expect to get skunked once in a while, then it's OK. Lately, I've been using two at a time so if one goes kaflewy the other will cross-check it.  Of course, that means going through probes twice as fast","domain":"housewares","label":"positive"}
{"review":"Many here complain that these thermometer probes burn out -- the insulation on the wires of course will melt if exposed to too high a temperature. If you're careful though you can use one probe for quite some time -- I'm into the 8th month with my current one, using it at least twice a week. It's important to note that, even if the air temperature inside your cooking device may not exceed the recommended range, the metal where the wire makes its way out of the device can. I use one quite frequently for grilling -- I run the wire out through one of the rotisserie holes -- and it's important to make sure the wire doesn't contact the grill bars themselves. For an oven at 350 degrees or less I've had no problems at all. When grilling, I also don't actually insert the probe until I know I'm close to finishing cooking -- this helps keep them alive. And, when they do burn out -- they're fairly cheap to replace","domain":"housewares","label":"positive"}
{"review":"I just received this replacement probe and calibrated it immediately.  In a pan of water at a rolling boil the new probe with an old (2 years) Polder thermometer / Timer at steady state registered 180 degrees F.  An instant-read thermometer read 212 degrees.  A new Polder dual-sensor thermo-timer (6 months from Amazon) read 239 degrees.  Both digital thermometers replicated their readings with brand new AAA batteries as well. Maybe the trick is use both thermometers and take an average. Don't waste your money on either Polder product.  Their accuracy does not warrent the risk of ruining a good roast","domain":"housewares","label":"negative"}